<template><div><h1 id="简介" tabindex="-1"><a class="header-anchor" href="#简介" aria-hidden="true">#</a> 简介</h1>
<p>Datum是以数据为服务对象，提供隐私保护能力，实现数据资产发行的高性能web3服务。Datum提供多样化的服务api及sdk，用户可以按需选择相关服务，实现数据传输存托、Data NFT发行、数据资产化管理、数据交易、可信分享、多方数据联合查询计算等需求，提供多样化的隐私增强技术提供数据应用中的全方位隐私保护。用户使用Datum就能轻松引流数据进入web3生态。</p>
<h2 id="服务能力" tabindex="-1"><a class="header-anchor" href="#服务能力" aria-hidden="true">#</a> 服务能力</h2>
<p>Datum对应数据流通的各环节，提供5大类服务能力：</p>
<ul>
<li>数据安全上链服务：以api及sdk形式为数据提供以IPFS、Arweave等去中心化存储以及AWS、Azure、GCP等云存储作为存储介质流转到Web3世界，为后续数据资产应用提供基础服务。</li>
<li>数据资产化服务： 以api及sdk形式提供数据资产发行服务，支持多种NFT合约模板，面向不同应用需求提供快速发布、查看、属性设置服务。</li>
<li>数据安全交易服务：以api及sak形式提供数据资产交易、授权访问、访问鉴权、使用下载、数据一致性校验服务。</li>
<li>数据预言机服务：以api及sdk形式为web2已有的数据服务、数据模型提供web3形态下的链下数据输入到链上合约调用的服务，提供各类服务组件使用户能快速基于数据预言机获取链下数据供链上Dapp使用。</li>
<li>数据安全计算服务：以api及sdk形式提供两方、多方数据资产的联合查询分析或计算服务，基于PSI、安全多方计算、同态加密等隐私增加技术提供数据隐私匹配、隐私查询、隐私统计分析及隐私AI能力。</li>
</ul>
</div></template>


