<template><div><h2 id="数据可信交易及授权功能原理和使用指南" tabindex="-1"><a class="header-anchor" href="#数据可信交易及授权功能原理和使用指南" aria-hidden="true">#</a> 数据可信交易及授权功能原理和使用指南</h2>
<p>数据可信交易及授权，提供围绕数据分享与数据资产交易，提供相关的权限访问控制、资产所有权转让及确认、申请明文数据授权访问与安全使用等服务。</p>
<h3 id="原理描述" tabindex="-1"><a class="header-anchor" href="#原理描述" aria-hidden="true">#</a> 原理描述</h3>
<ul>
<li>
<p>图示</p>
<p><img src="@source/img/数据可信交易及授权.png" alt=""></p>
</li>
<li>
<p>概述</p>
<ul>
<li>数据资产化后，即可拥有跟数据对应的NFT，NFT上有元数据信息，用户可以在区块链查看；</li>
<li>NFT中记录了对应的权限信息，如所有权和使用权等；当用户在NFT交易市场上购买指定NFT时，即可获得NFT对应的权限；</li>
<li>Datum提供原始数据的可信托管服务，对于托管的数据，Datum使用代理重加密方式，将数据加密之后存储在托管服务上；用户需要访问明文数据时，只需要申请访问明文数据权限，即可获得数据的解密密钥；</li>
<li>NFT上记录了原数据的存储位置，用户持有NFT在通过验证后，向原数据的存储服务发出查看或下载的请求；</li>
<li>对于托管数据，用户查看和下载的是加密后的原数据，需要通过申请访问明文数据权限获得的解密密钥进行解密，即可获得明文数据；</li>
<li>NFT上记录了原数据的哈希值，用于校验数据的一致性，用户通过持有的NFT即可对下载的原数据进行校验一致性。</li>
</ul>
</li>
</ul>
<h3 id="使用流程" tabindex="-1"><a class="header-anchor" href="#使用流程" aria-hidden="true">#</a> 使用流程</h3>
<ul>
<li>调用元数据查看api，即可获得对于NFT的元数据详情，用户通过元数据详情决定要不要购买NFT；</li>
<li>用户通过NFT交易市场购买NFT；</li>
<li>对于托管存储的原数据（数据存储方式用户可以根据元数据详情中获取），用户需要申请授权访问明文数据权限，获得解密密钥；</li>
<li>用户调用原数据查看或下载api对原数据进行访问；</li>
<li>对于托管存储的原数据，需要使用解密密钥进行解密，获得明文数据；</li>
</ul>
<p>详细的api使用说明，请参考<RouterLink to="/%E5%8A%9F%E8%83%BD%E4%BB%8B%E7%BB%8D/%E6%95%B0%E6%8D%AE%E5%8F%AF%E4%BF%A1%E4%BA%A4%E6%98%93%E5%8F%8A%E6%8E%88%E6%9D%83.html">数据可信交易及授权</RouterLink>。</p>
</div></template>


